Revit 2026 API

# RebarConstraintTargetIsHookBend Method

---

Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool TargetIsHookBend()
```
```vb
Public Function TargetIsHookBend As Boolean
```
```cpp
public:
bool TargetIsHookBend()
```
```fsharp
member TargetIsHookBend : unit -> bool
```

#### Return Value

Boolean

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace